<template>
  <templateDemos title="基本用法" :code="code">
    <Collapse :selected.sync="collapseSelected">
      <CollapseItem title="基本信息" name="desc">
        手风琴是一件附有键盘的自由簧乐器。演奏时，中央部分需要左右伸缩，以引入气流颤动琴内的簧片发声。
        法国传教士Joseph-Marie Amiot于1777年将中国的笙传入欧洲，促成了口琴及手风琴等自由簧乐器的发明。
        1822年由德国人布希曼（Friedrich Ludwig Buschmann）创制；1829年经奥地利人岱密安（Cyrill Demian）等改良而渐趋完善。
      </CollapseItem>
      <CollapseItem title="起源" name="origin">
        1777年，中国器乐“笙”由意大利传教士阿莫依特神父传入欧洲，随即便在欧洲开始出现了一些手风琴的前身乐器，但它们大都未能成形便被淘汰了。真正用手拉的风琴是由德国人德里克·布斯曼（Friedrdch
        Buschman，1805—1864 ）在1821年制造了用口吹的奥拉琴，1822年又在琴上增加了手控风箱和键钮，后来，奥地利人西里勒斯·德米安（Cyrillus Demian
        1772—1847）在布斯曼的基础上，集当时手风琴的各种前身乐器之大成，成功地改良创制了世界上第一架被定名为accordion的手风琴。直到2019年，世界各地仍然沿用accordion这个名称。
      </CollapseItem>
      <CollapseItem title="主要阶段" name="accented">
        自手风琴的创制2019年，在制造工艺、演奏技巧和手风琴专业音乐创作等方面都有极大的、变革性的发展。当今西德荷莱琴厂生产的185贝司的高级手风琴，已成为国际手风琴界所惊赞、神往、欲求不得的珍品。现代手风琴不仅可以担任伴奏、独奏，参加重奏、合奏、协奏，而且可以单独演奏古典各派音乐大师们的大型音乐作品的原作。随着手风琴这种乐器的不断完善和演奏技巧的迅速发展，手风琴专业音乐创作引起了众多作曲家们的重视，为手风琴专门写作的作品越来越多。总之，在一百多年的时间内，手风琴由原来的雏形发展成这样完善精美的乐器，其发展速度是相当惊人的，在乐器发展史上也是少见的。
        手风琴是在全世界范围的，最为广泛普及的乐器之一。在当代，手风琴不仅在专业乐坛上，而且在大众音乐文化生活中也占据着极为重要的地位。早在一九三一年，德国便在特洛辛根市建立了一所手风琴专业学校。到一九四八年学校进而改为州立手风琴学院。在英国，则把手风琴作为发展音乐教育事业的不可缺少的重要工具。一九三六年建立了“英国手风琴演奏者学院”，为发展英国的音乐事业做出了重要贡献，同时也使英国成为手风琴音乐创作最为繁荣、文献资料最为丰富的国家之一。国际音乐组织建有国际手风琴协会，并经常举办国际性的手风琴比赛。在西方一些著名音乐校里都建立了手风琴系，在一些普通大学里，也设有手风琴专业。
      </CollapseItem>
    </Collapse>
  </templateDemos>

</template>

<script>
import templateDemos from "./template-demos";
import Collapse from "../../../src/collapse";
import CollapseItem from "../../../src/collapse-item";
export default {
  name: "collapse-demos",
  components: {
    Collapse,
    CollapseItem,
    templateDemos,
  },
  data() {
    return {
      collapseSelected: ["item1"],
      code: `
                <Collapse :selected.sync="collapseSelected" single>
            <CollapseItem title="手风琴" name="desc">
                手风琴是一件附有键盘的自由簧乐器。演奏时，中央部分需要左右伸缩，以引入气流颤动琴内的簧片发声。
                法国传教士Joseph-Marie Amiot于1777年将中国的笙传入欧洲，促成了口琴及手风琴等自由簧乐器的发明。
                1822年由德国人布希曼（Friedrich Ludwig Buschmann）创制；1829年经奥地利人岱密安（Cyrill Demian）等改良而渐趋完善。
            </CollapseItem>
            <CollapseItem title="起源" name="origin">
                1777年，中国器乐“笙”由意大利传教士阿莫依特神父传入欧洲，随即便在欧洲开始出现了一些手风琴的前身乐器，但它们大都未能成形便被淘汰了。真正用手拉的风琴是由德国人德里克·布斯曼（Friedrdch
                Buschman，1805—1864 ）在1821年制造了用口吹的奥拉琴，1822年又在琴上增加了手控风箱和键钮，后来，奥地利人西里勒斯·德米安（Cyrillus Demian
                1772—1847）在布斯曼的基础上，集当时手风琴的各种前身乐器之大成，成功地改良创制了世界上第一架被定名为accordion的手风琴。直到2019年，世界各地仍然沿用accordion这个名称。
            </CollapseItem>
            <CollapseItem title="主要阶段" name="accented">
                自手风琴的创制2019年，在制造工艺、演奏技巧和手风琴专业音乐创作等方面都有极大的、变革性的发展。当今西德荷莱琴厂生产的185贝司的高级手风琴，已成为国际手风琴界所惊赞、神往、欲求不得的珍品。现代手风琴不仅可以担任伴奏、独奏，参加重奏、合奏、协奏，而且可以单独演奏古典各派音乐大师们的大型音乐作品的原作。随着手风琴这种乐器的不断完善和演奏技巧的迅速发展，手风琴专业音乐创作引起了众多作曲家们的重视，为手风琴专门写作的作品越来越多。总之，在一百多年的时间内，手风琴由原来的雏形发展成这样完善精美的乐器，其发展速度是相当惊人的，在乐器发展史上也是少见的。
                手风琴是在全世界范围的，最为广泛普及的乐器之一。在当代，手风琴不仅在专业乐坛上，而且在大众音乐文化生活中也占据着极为重要的地位。早在一九三一年，德国便在特洛辛根市建立了一所手风琴专业学校。到一九四八年学校进而改为州立手风琴学院。在英国，则把手风琴作为发展音乐教育事业的不可缺少的重要工具。一九三六年建立了“英国手风琴演奏者学院”，为发展英国的音乐事业做出了重要贡献，同时也使英国成为手风琴音乐创作最为繁荣、文献资料最为丰富的国家之一。国际音乐组织建有国际手风琴协会，并经常举办国际性的手风琴比赛。在西方一些著名音乐校里都建立了手风琴系，在一些普通大学里，也设有手风琴专业。
            </CollapseItem>
        </Collapse>
`,
    };
  },
};
</script>

<style lang="scss" scoped>
</style>